In [1]:
#create 1d array and insert values from 0 to 20 within 3 gap space and find the values which are divided by 2,and replace 0 in array which arenot satisfied the condition

In [3]:
import numpy as np
import pandas as pd
s1=pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [5]:
s2=pd.Series([1,2,3],index=['a','b','c'])
s2

a    1
b    2
c    3
dtype: int64

In [6]:
#creating data frames
#method1

data={'Name':['Alice','Bob','Nimal'],'Age':[25,30,22]}
df=pd.DataFrame(data)
df

    Name  Age
0  Alice   25
1    Bob   30
2  Nimal   22

In [8]:
#method2
#create a list of dictionaries
list_of_dicts=[{'column_a':1,'column_b':2,'column_c':3},
              {'column_a':10,'column_b':20,'column_c':30}]

#create dataframe
df=pd.DataFrame(list_of_dicts)
df

   column_a  column_b  column_c
0         1         2         3
1        10        20        30

In [9]:
list_of_dicts=[{'column_a':1,'column_b':2,'column_c':3},
              {'column_a':10,'column_b':20,'column_c':30}]

#create dataframe
df=pd.DataFrame(list_of_dicts,index=['row_1','row_2'])
df

       column_a  column_b  column_c
row_1         1         2         3
row_2        10        20        30

In [10]:
#method4
#creating a dataframe from a list of tuples:
import pandas as pd

#create a list of tuples
list_of_tuples=[(8,'August',1998),(2,'January',1987),
               (17,'July',2021),(24,'June',2022)]

#creating the dataframe
df=pd.DataFrame(list_of_tuples,columns=['Date','Month','Year'])
display(df)

   Date    Month  Year
0     8   August  1998
1     2  January  1987
2    17     July  2021
3    24     June  2022

In [11]:
#method5
#creating dataframe using zip() function

import pandas as pd

#list1
students=['Alan','Vivian','Alistar','Jade']

#list2
age=[24,26,32,29]

#usig zip to merge two lists
list_of_tuples=list(zip(students,age))

#list(zip(students,age)) will return

#converting the lists ofr tuples to pandas dataframe
df=pd.DataFrame(list_of_tuples,columns=['students','age'])
display(df)

  students  age
0     Alan   24
1   Vivian   26
2  Alistar   32
3     Jade   29

In [12]:
print(df.head())
print('#####')
print(df.info())
print('#####')
print(df.shape)
print('#####')
print(df.describe())
print('#####')
print(df.columns)
print('#####')
print(df.index)
print('#####')
print(df.values)

  students  age
0     Alan   24
1   Vivian   26
2  Alistar   32
3     Jade   29
#####
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   students  4 non-null      object
 1   age       4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes
None
#####
(4, 2)
#####
         age
count   4.00
mean   27.75
std     3.50
min    24.00
25%    25.50
50%    27.50
75%    29.75
max    32.00
#####
Index(['students', 'age'], dtype='object')
#####
RangeIndex(start=0, stop=4, step=1)
#####
[['Alan' 24]
 ['Vivian' 26]
 ['Alistar' 32]
 ['Jade' 29]]

In [13]:
import pandas as pd

Name=['Alice','Bob','Charlie','David','Karl','Amile','Daminam']
age=[25,30,22,28,19,22,27]
scores=[85,70,90,80,75,77,82]
city=['newyork','Los Angeles','Frankfurt','London','Oslo','Brcelona','Frankfurt']
list_of_tuples=list(zip(Name,age,scores,city))
df=pd.DataFrame(list_of_tuples,columns=['Name','age','scores','city'])
display(df)

      Name  age  scores         city
0    Alice   25      85      newyork
1      Bob   30      70  Los Angeles
2  Charlie   22      90    Frankfurt
3    David   28      80       London
4     Karl   19      75         Oslo
5    Amile   22      77     Brcelona
6  Daminam   27      82    Frankfurt

In [25]:
# 1.selection by column names(single or list)
selected_df_1=df['Name'] #selecting a single column by name
selected_df_2=df[['Name','scores']] #ng a list of column names
selected_df_1
selected_df_2

      Name  scores
0    Alice      85
1      Bob      70
2  Charlie      90
3    David      80
4     Karl      75
5    Amile      77
6  Daminam      82

In [27]:
# 2.Selection by positional indexing
selected_df_3=df[0:2] #selecting first 2 columns(zero-based indexing)
selected_df_4=df.iloc[:,1:3] #selecting columns from index 1(inclusive) to
selected_df_3
selected_df_4

   age  scores
0   25      85
1   30      70
2   22      90
3   28      80
4   19      75
5   22      77
6   27      82

In [26]:
# 3.Selection with .Loc(label-based)
selected_df_6=df.loc[:,['Name','city']] #selecting columns from 'name' and'city'
(selected_df_6)

      Name         city
0    Alice      newyork
1      Bob  Los Angeles
2  Charlie    Frankfurt
3    David       London
4     Karl         Oslo
5    Amile     Brcelona
6  Daminam    Frankfurt

In [29]:
#sorting rows within pandas dataframe
import pandas as pd

raw_data={"first_name":["Sheldon","Raj","Lenord","Howard","Amy"],
         "last_name":["Copper","Koothrappali","Hofstadter","Wolwitz","Fowler"],
                     "age":[42,38,36,41,35],
                     "Comedy_Score":[9,7,8,8,5],
         "Rating_Score":[25,25,49,62,70]}

df=pd.DataFrame(raw_data,columns=["first_name","last_name","age","Comedy_Score","Rating_Score"])
print(df)

  first_name     last_name  age  Comedy_Score  Rating_Score
0    Sheldon        Copper   42             9            25
1        Raj  Koothrappali   38             7            25
2     Lenord    Hofstadter   36             8            49
3     Howard       Wolwitz   41             8            62
4        Amy        Fowler   35             5            70

In [30]:
print(df.sort_values(by="age",ascending=0))
print();
print(df.sort_values(by="age",ascending=1))
print();
print(df.sort_values(by=["age","Comedy_Score"]))
print();

  first_name     last_name  age  Comedy_Score  Rating_Score
0    Sheldon        Copper   42             9            25
3     Howard       Wolwitz   41             8            62
1        Raj  Koothrappali   38             7            25
2     Lenord    Hofstadter   36             8            49
4        Amy        Fowler   35             5            70

  first_name     last_name  age  Comedy_Score  Rating_Score
4        Amy        Fowler   35             5            70
2     Lenord    Hofstadter   36             8            49
1        Raj  Koothrappali   38             7            25
3     Howard       Wolwitz   41             8            62
0    Sheldon        Copper   42             9            25

  first_name     last_name  age  Comedy_Score  Rating_Score
4        Amy        Fowler   35             5            70
2     Lenord    Hofstadter   36             8            49
1        Raj  Koothrappali   38             7            25
3     Howard       Wolwitz   41             8            62
0    Sheldon        Copper   42             9            25

In [34]:
#groupBy on a Single Column(Group)
group_g=df.groupby(["first_name"])
print(group_g)
print(group_g.size())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000024C77973AC0>
first_name
Amy        1
Howard     1
Lenord     1
Raj        1
Sheldon    1
dtype: int64

In [39]:
#How to  find the  largest and Lowest value in a pandas dataframe
print("Index of largest value:");print(df['Comedy_Score'].idxmax())
print("Index of lowest value:");print(df['Comedy_Score'].idxmin())

Index of largest value:
0
Index of lowest value:
4